# –ü—Ä–æ–µ–∫—Ç "–ö–Ω–∏–∂–Ω—ã–π —Å–µ—Ä–≤–∏—Å"

<h3>–°–æ–¥–µ—Ä–∂–∞–Ω–∏–µ –ø—Ä–æ–µ–∫—Ç–∞<span class="tocSkip"></span></h3>
<div class="toc"><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#–û–ø–∏—Å–∞–Ω–∏–µ-–ø—Ä–æ–µ–∫—Ç–∞" data-toc-modified-id="–û–ø–∏—Å–∞–Ω–∏–µ-–ø—Ä–æ–µ–∫—Ç–∞-0.1"><span class="toc-item-num">0.1&nbsp;&nbsp;</span>–û–ø–∏—Å–∞–Ω–∏–µ –ø—Ä–æ–µ–∫—Ç–∞</a></span></li><li><span><a href="#–ó–∞–¥–∞—á–∏-–ø—Ä–æ–µ–∫—Ç–∞" data-toc-modified-id="–ó–∞–¥–∞—á–∏-–ø—Ä–æ–µ–∫—Ç–∞-0.2"><span class="toc-item-num">0.2&nbsp;&nbsp;</span>–ó–∞–¥–∞—á–∏ –ø—Ä–æ–µ–∫—Ç–∞</a></span></li><li><span><a href="#–û–ø–∏—Å–∞–Ω–∏–µ-–¥–∞–Ω–Ω—ã—Ö" data-toc-modified-id="–û–ø–∏—Å–∞–Ω–∏–µ-–¥–∞–Ω–Ω—ã—Ö-0.3"><span class="toc-item-num">0.3&nbsp;&nbsp;</span>–û–ø–∏—Å–∞–Ω–∏–µ –¥–∞–Ω–Ω—ã—Ö</a></span></li><li><span><a href="#–ó–∞–¥–∞–Ω–∏—è" data-toc-modified-id="–ó–∞–¥–∞–Ω–∏—è-0.4"><span class="toc-item-num">0.4&nbsp;&nbsp;</span>–ó–∞–¥–∞–Ω–∏—è</a></span></li></ul></li><li><span><a href="#–ü–æ–¥–∫–ª—é—á–µ–Ω–∏–µ-–∫-–±–∞–∑–µ" data-toc-modified-id="–ü–æ–¥–∫–ª—é—á–µ–Ω–∏–µ-–∫-–±–∞–∑–µ-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>–ü–æ–¥–∫–ª—é—á–µ–Ω–∏–µ –∫ –±–∞–∑–µ</a></span><ul class="toc-item"><li><span><a href="#–ò–º–ø–æ—Ä—Ç-–±–∏–±–ª–∏–æ—Ç–µ–∫" data-toc-modified-id="–ò–º–ø–æ—Ä—Ç-–±–∏–±–ª–∏–æ—Ç–µ–∫-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>–ò–º–ø–æ—Ä—Ç –±–∏–±–ª–∏–æ—Ç–µ–∫</a></span></li><li><span><a href="#–°–æ–∑–¥–∞–Ω–∏–µ-–ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è" data-toc-modified-id="–°–æ–∑–¥–∞–Ω–∏–µ-–ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>–°–æ–∑–¥–∞–Ω–∏–µ –ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è</a></span></li></ul></li><li><span><a href="#–ò—Å—Å–ª–µ–¥–æ–≤–∞–Ω–∏–µ-—Ç–∞–±–ª–∏—Ü" data-toc-modified-id="–ò—Å—Å–ª–µ–¥–æ–≤–∞–Ω–∏–µ-—Ç–∞–±–ª–∏—Ü-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>–ò—Å—Å–ª–µ–¥–æ–≤–∞–Ω–∏–µ —Ç–∞–±–ª–∏—Ü</a></span><ul class="toc-item"><li><span><a href="#–¢–∞–±–ª–∏—Ü–∞-books" data-toc-modified-id="–¢–∞–±–ª–∏—Ü–∞-books-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>–¢–∞–±–ª–∏—Ü–∞ books</a></span></li><li><span><a href="#–¢–∞–±–ª–∏—Ü–∞-authors" data-toc-modified-id="–¢–∞–±–ª–∏—Ü–∞-authors-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>–¢–∞–±–ª–∏—Ü–∞ authors</a></span></li><li><span><a href="#–¢–∞–±–ª–∏—Ü–∞-publishers" data-toc-modified-id="–¢–∞–±–ª–∏—Ü–∞-publishers-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>–¢–∞–±–ª–∏—Ü–∞ publishers</a></span></li><li><span><a href="#–¢–∞–±–ª–∏—Ü–∞-ratings" data-toc-modified-id="–¢–∞–±–ª–∏—Ü–∞-ratings-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>–¢–∞–±–ª–∏—Ü–∞ ratings</a></span></li><li><span><a href="#–¢–∞–±–ª–∏—Ü–∞-reviews" data-toc-modified-id="–¢–∞–±–ª–∏—Ü–∞-reviews-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>–¢–∞–±–ª–∏—Ü–∞ reviews</a></span></li></ul></li><li><span><a href="#–ó–∞–¥–∞–Ω–∏—è" data-toc-modified-id="–ó–∞–¥–∞–Ω–∏—è-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>–ó–∞–¥–∞–Ω–∏—è</a></span><ul class="toc-item"><li><span><a href="#–ö–Ω–∏–≥–∏-–ø–æ—Å–ª–µ-1-—è–Ω–≤–∞—Ä—è-2000-–≥–æ–¥–∞" data-toc-modified-id="–ö–Ω–∏–≥–∏-–ø–æ—Å–ª–µ-1-—è–Ω–≤–∞—Ä—è-2000-–≥–æ–¥–∞-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>–ö–Ω–∏–≥–∏ –ø–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞</a></span><ul class="toc-item"><li><span><a href="#–†–µ—à–µ–Ω–∏–µ" data-toc-modified-id="–†–µ—à–µ–Ω–∏–µ-3.1.1"><span class="toc-item-num">3.1.1&nbsp;&nbsp;</span>–†–µ—à–µ–Ω–∏–µ</a></span></li><li><span><a href="#–í—ã–≤–æ–¥" data-toc-modified-id="–í—ã–≤–æ–¥-3.1.2"><span class="toc-item-num">3.1.2&nbsp;&nbsp;</span>–í—ã–≤–æ–¥</a></span></li></ul></li><li><span><a href="#–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ-–æ–±–∑–æ—Ä–æ–≤-–∏-—Å—Ä–µ–¥–Ω—è—è-–æ—Ü–µ–Ω–∫–∞" data-toc-modified-id="–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ-–æ–±–∑–æ—Ä–æ–≤-–∏-—Å—Ä–µ–¥–Ω—è—è-–æ—Ü–µ–Ω–∫–∞-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –∏ —Å—Ä–µ–¥–Ω—è—è –æ—Ü–µ–Ω–∫–∞</a></span><ul class="toc-item"><li><span><a href="#–ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞-–∫-—Ä–µ—à–µ–Ω–∏—é" data-toc-modified-id="–ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞-–∫-—Ä–µ—à–µ–Ω–∏—é-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>–ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞ –∫ —Ä–µ—à–µ–Ω–∏—é</a></span></li><li><span><a href="#–†–µ—à–µ–Ω–∏–µ" data-toc-modified-id="–†–µ—à–µ–Ω–∏–µ-3.2.2"><span class="toc-item-num">3.2.2&nbsp;&nbsp;</span>–†–µ—à–µ–Ω–∏–µ</a></span></li><li><span><a href="#–ü—Ä–≤–µ—Ä–∫–∞" data-toc-modified-id="–ü—Ä–≤–µ—Ä–∫–∞-3.2.3"><span class="toc-item-num">3.2.3&nbsp;&nbsp;</span>–ü—Ä–≤–µ—Ä–∫–∞</a></span></li><li><span><a href="#–í—ã–≤–æ–¥" data-toc-modified-id="–í—ã–≤–æ–¥-3.2.4"><span class="toc-item-num">3.2.4&nbsp;&nbsp;</span>–í—ã–≤–æ–¥</a></span></li></ul></li><li><span><a href="#–ò–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ-—Å-–Ω–∞–∏–±–æ–ª—å—à–∏–º-—á–∏—Å–ª–æ–º-–∫–Ω–∏–≥" data-toc-modified-id="–ò–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ-—Å-–Ω–∞–∏–±–æ–ª—å—à–∏–º-—á–∏—Å–ª–æ–º-–∫–Ω–∏–≥-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>–ò–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ —Å –Ω–∞–∏–±–æ–ª—å—à–∏–º —á–∏—Å–ª–æ–º –∫–Ω–∏–≥</a></span><ul class="toc-item"><li><span><a href="#–ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞-–∫-—Ä–µ—à–µ–Ω–∏—é" data-toc-modified-id="–ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞-–∫-—Ä–µ—à–µ–Ω–∏—é-3.3.1"><span class="toc-item-num">3.3.1&nbsp;&nbsp;</span>–ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞ –∫ —Ä–µ—à–µ–Ω–∏—é</a></span></li><li><span><a href="#–†–µ—à–µ–Ω–∏–µ" data-toc-modified-id="–†–µ—à–µ–Ω–∏–µ-3.3.2"><span class="toc-item-num">3.3.2&nbsp;&nbsp;</span>–†–µ—à–µ–Ω–∏–µ</a></span></li><li><span><a href="#–ü—Ä–æ–≤–µ—Ä–∫–∞-–∏–∑–¥–∞–Ω–∏–π-&quot;–±–µ–∑-–∫–Ω–∏–≥&quot;" data-toc-modified-id="–ü—Ä–æ–≤–µ—Ä–∫–∞-–∏–∑–¥–∞–Ω–∏–π-&quot;–±–µ–∑-–∫–Ω–∏–≥&quot;-3.3.3"><span class="toc-item-num">3.3.3&nbsp;&nbsp;</span>–ü—Ä–æ–≤–µ—Ä–∫–∞ –∏–∑–¥–∞–Ω–∏–π "–±–µ–∑ –∫–Ω–∏–≥"</a></span></li><li><span><a href="#–í—ã–≤–æ–¥" data-toc-modified-id="–í—ã–≤–æ–¥-3.3.4"><span class="toc-item-num">3.3.4&nbsp;&nbsp;</span>–í—ã–≤–æ–¥</a></span></li></ul></li><li><span><a href="#–ê–≤—Ç–æ—Ä-—Å-—Å–∞–º–æ–π-–≤—ã—Å–æ–∫–æ–π-—Å—Ä–µ–¥–Ω–µ–π-–æ—Ü–µ–Ω–∫–æ–π" data-toc-modified-id="–ê–≤—Ç–æ—Ä-—Å-—Å–∞–º–æ–π-–≤—ã—Å–æ–∫–æ–π-—Å—Ä–µ–¥–Ω–µ–π-–æ—Ü–µ–Ω–∫–æ–π-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>–ê–≤—Ç–æ—Ä —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π</a></span><ul class="toc-item"><li><span><a href="#–ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞-–∫-—Ä–µ—à–µ–Ω–∏—é" data-toc-modified-id="–ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞-–∫-—Ä–µ—à–µ–Ω–∏—é-3.4.1"><span class="toc-item-num">3.4.1&nbsp;&nbsp;</span>–ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞ –∫ —Ä–µ—à–µ–Ω–∏—é</a></span></li><li><span><a href="#–†–µ—à–µ–Ω–∏–µ" data-toc-modified-id="–†–µ—à–µ–Ω–∏–µ-3.4.2"><span class="toc-item-num">3.4.2&nbsp;&nbsp;</span>–†–µ—à–µ–Ω–∏–µ</a></span></li><li><span><a href="#–í—ã–≤–æ–¥—ã" data-toc-modified-id="–í—ã–≤–æ–¥—ã-3.4.3"><span class="toc-item-num">3.4.3&nbsp;&nbsp;</span>–í—ã–≤–æ–¥—ã</a></span></li></ul></li><li><span><a href="#–û–±–∑–æ—Ä—ã-–ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π" data-toc-modified-id="–û–±–∑–æ—Ä—ã-–ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>–û–±–∑–æ—Ä—ã –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π</a></span><ul class="toc-item"><li><span><a href="#–ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞-–∫-—Ä–µ—à–µ–Ω–∏—é" data-toc-modified-id="–ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞-–∫-—Ä–µ—à–µ–Ω–∏—é-3.5.1"><span class="toc-item-num">3.5.1&nbsp;&nbsp;</span>–ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞ –∫ —Ä–µ—à–µ–Ω–∏—é</a></span></li><li><span><a href="#–†–µ—à–µ–Ω–∏–µ" data-toc-modified-id="–†–µ—à–µ–Ω–∏–µ-3.5.2"><span class="toc-item-num">3.5.2&nbsp;&nbsp;</span>–†–µ—à–µ–Ω–∏–µ</a></span></li><li><span><a href="#–ü—Ä–æ–≤–µ—Ä–∫–∞" data-toc-modified-id="–ü—Ä–æ–≤–µ—Ä–∫–∞-3.5.3"><span class="toc-item-num">3.5.3&nbsp;&nbsp;</span>–ü—Ä–æ–≤–µ—Ä–∫–∞</a></span></li><li><span><a href="#–í—ã–≤–æ–¥—ã" data-toc-modified-id="–í—ã–≤–æ–¥—ã-3.5.4"><span class="toc-item-num">3.5.4&nbsp;&nbsp;</span>–í—ã–≤–æ–¥—ã</a></span></li></ul></li></ul></li><li><span><a href="#–í—ã–≤–æ–¥—ã-–ø–æ-–∑–∞–¥–∞–Ω–∏—è–º-–∏-–ø—Ä–µ–¥–ª–æ–∂–µ–Ω–∏—è" data-toc-modified-id="–í—ã–≤–æ–¥—ã-–ø–æ-–∑–∞–¥–∞–Ω–∏—è–º-–∏-–ø—Ä–µ–¥–ª–æ–∂–µ–Ω–∏—è-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>–í—ã–≤–æ–¥—ã –ø–æ –∑–∞–¥–∞–Ω–∏—è–º –∏ –ø—Ä–µ–¥–ª–æ–∂–µ–Ω–∏—è</a></span><ul class="toc-item"><li><span><a href="#–í—ã–≤–æ–¥—ã" data-toc-modified-id="–í—ã–≤–æ–¥—ã-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>–í—ã–≤–æ–¥—ã</a></span></li><li><span><a href="#–ü—Ä–µ–¥–ª–æ–∂–µ–Ω–∏—è" data-toc-modified-id="–ü—Ä–µ–¥–ª–æ–∂–µ–Ω–∏—è-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>–ü—Ä–µ–¥–ª–æ–∂–µ–Ω–∏—è</a></span></li></ul></li></ul></div>

### –û–ø–∏—Å–∞–Ω–∏–µ –ø—Ä–æ–µ–∫—Ç–∞

–ö–æ—Ä–æ–Ω–∞–≤–∏—Ä—É—Å –∑–∞—Å—Ç–∞–ª –º–∏—Ä –≤—Ä–∞—Å–ø–ª–æ—Ö, –∏–∑–º–µ–Ω–∏–≤ –ø—Ä–∏–≤—ã—á–Ω—ã–π –ø–æ—Ä—è–¥–æ–∫ –≤–µ—â–µ–π. –í —Å–≤–æ–±–æ–¥–Ω–æ–µ –≤—Ä–µ–º—è –∂–∏—Ç–µ–ª–∏ –≥–æ—Ä–æ–¥–æ–≤ –±–æ–ª—å—à–µ –Ω–µ –≤—ã—Ö–æ–¥—è—Ç –Ω–∞ —É–ª–∏—Ü—É, –Ω–µ –ø–æ—Å–µ—â–∞—é—Ç –∫–∞—Ñ–µ –∏ —Ç–æ—Ä–≥–æ–≤—ã–µ —Ü–µ–Ω—Ç—Ä—ã. –ó–∞—Ç–æ —Å—Ç–∞–ª–æ –±–æ–ª—å—à–µ –≤—Ä–µ–º–µ–Ω–∏ –¥–ª—è –∫–Ω–∏–≥. –≠—Ç–æ –∑–∞–º–µ—Ç–∏–ª–∏ —Å—Ç–∞—Ä—Ç–∞–ø–µ—Ä—ã ‚Äî –∏ –±—Ä–æ—Å–∏–ª–∏—Å—å —Å–æ–∑–¥–∞–≤–∞—Ç—å –ø—Ä–∏–ª–æ–∂–µ–Ω–∏—è –¥–ª—è —Ç–µ—Ö, –∫—Ç–æ –ª—é–±–∏—Ç —á–∏—Ç–∞—Ç—å.

–í–∞—à–∞ –∫–æ–º–ø–∞–Ω–∏—è —Ä–µ—à–∏–ª–∞ –±—ã—Ç—å –Ω–∞ –≤–æ–ª–Ω–µ –∏ –∫—É–ø–∏–ª–∞ –∫—Ä—É–ø–Ω—ã–π —Å–µ—Ä–≤–∏—Å –¥–ª—è —á—Ç–µ–Ω–∏—è –∫–Ω–∏–≥ –ø–æ –ø–æ–¥–ø–∏—Å–∫–µ. –í–∞—à–∞ –ø–µ—Ä–≤–∞—è –∑–∞–¥–∞—á–∞ –∫–∞–∫ –∞–Ω–∞–ª–∏—Ç–∏–∫–∞ ‚Äî –ø—Ä–æ–∞–Ω–∞–ª–∏–∑–∏—Ä–æ–≤–∞—Ç—å –±–∞–∑—É –¥–∞–Ω–Ω—ã—Ö.
–í –Ω–µ–π ‚Äî –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è –æ –∫–Ω–∏–≥–∞—Ö, –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞—Ö, –∞–≤—Ç–æ—Ä–∞—Ö, –∞ —Ç–∞–∫–∂–µ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏–µ –æ–±–∑–æ—Ä—ã –∫–Ω–∏–≥. –≠—Ç–∏ –¥–∞–Ω–Ω—ã–µ –ø–æ–º–æ–≥—É—Ç —Å—Ñ–æ—Ä–º—É–ª–∏—Ä–æ–≤–∞—Ç—å —Ü–µ–Ω–Ω–æ—Å—Ç–Ω–æ–µ –ø—Ä–µ–¥–ª–æ–∂–µ–Ω–∏–µ –¥–ª—è –Ω–æ–≤–æ–≥–æ –ø—Ä–æ–¥—É–∫—Ç–∞.

### –ó–∞–¥–∞—á–∏ –ø—Ä–æ–µ–∫—Ç–∞

**–¶–µ–ª—å –ø—Ä–æ–µ–∫—Ç–∞:** –∏–∑—É—á–∏—Ç—å –¥–∞–Ω–Ω—ã–µ –∏ —Å—Ñ–æ—Ä–º—É–ª–∏—Ä–æ–≤–∞—Ç—å –ø—Ä–µ–¥–ª–æ–∂–µ–Ω–∏—è –ø–æ –Ω–æ–≤–æ–º—É –ø—Ä–æ–¥—É–∫—Ç—É. 

**–ó–∞–¥–∞—á–∏ –ø—Ä–æ–µ–∫—Ç–∞:** 
1. –ü—Ä–æ–∞–Ω–∞–ª–∏–∑–∏—Ä–æ–≤–∞—Ç—å –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—é –æ –∫–Ω–∏–≥–∞—Ö, –∞–≤—Ç–æ—Ä–∞—Ö –∏ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞—Ö, –∞ —Ç–∞–∫–∂–µ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏–µ –æ–±–∑–æ—Ä—ã –∫–Ω–∏–≥ 
2. –°—Ñ–æ—Ä–º—É–ª–∏—Ä–æ–≤–∞—Ç—å –ø—Ä–µ–¥–ª–æ–∂–µ–Ω–∏—è –ø–æ –ø—Ä–æ–¥—É–∫—Ç—É

### –û–ø–∏—Å–∞–Ω–∏–µ –¥–∞–Ω–Ω—ã—Ö

**–¢–∞–±–ª–∏—Ü–∞ `books`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –∫–Ω–∏–≥–∞—Ö:

- `book_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;
- `author_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∞–≤—Ç–æ—Ä–∞;
- `title` ‚Äî –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–Ω–∏–≥–∏;
- `num_pages` ‚Äî –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —Å—Ç—Ä–∞–Ω–∏—Ü;
- `publication_date` ‚Äî –¥–∞—Ç–∞ –ø—É–±–ª–∏–∫–∞—Ü–∏–∏ –∫–Ω–∏–≥–∏;
- `publisher_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∏–∑–¥–∞—Ç–µ–ª—è.

**–¢–∞–±–ª–∏—Ü–∞ `authors`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ–± –∞–≤—Ç–æ—Ä–∞—Ö:

- `author_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∞–≤—Ç–æ—Ä–∞;
- `author` ‚Äî –∏–º—è –∞–≤—Ç–æ—Ä–∞.

**–¢–∞–±–ª–∏—Ü–∞ `publishers`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ–± –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞—Ö:

- `publisher_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞;
- `publisher` ‚Äî –Ω–∞–∑–≤–∞–Ω–∏–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞;

**–¢–∞–±–ª–∏—Ü–∞ `ratings`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏—Ö –æ—Ü–µ–Ω–∫–∞—Ö –∫–Ω–∏–≥:

- `rating_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –æ—Ü–µ–Ω–∫–∏;
- `book_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;
- `username` ‚Äî –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è, –æ—Å—Ç–∞–≤–∏–≤—à–µ–≥–æ –æ—Ü–µ–Ω–∫—É;
- `rating` ‚Äî –æ—Ü–µ–Ω–∫–∞ –∫–Ω–∏–≥–∏.

**–¢–∞–±–ª–∏—Ü–∞ `reviews`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏—Ö –æ–±–∑–æ—Ä–∞—Ö –Ω–∞ –∫–Ω–∏–≥–∏:

- `review_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –æ–±–∑–æ—Ä–∞;
- `book_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;
- `username` ‚Äî –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è, –Ω–∞–ø–∏—Å–∞–≤—à–µ–≥–æ –æ–±–∑–æ—Ä;
- `text` ‚Äî —Ç–µ–∫—Å—Ç –æ–±–∑–æ—Ä–∞.

### –ó–∞–¥–∞–Ω–∏—è

1. –ü–æ—Å—á–∏—Ç–∞–π—Ç–µ, —Å–∫–æ–ª—å–∫–æ –∫–Ω–∏–≥ –≤—ã—à–ª–æ –ø–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞;
2. –î–ª—è –∫–∞–∂–¥–æ–π –∫–Ω–∏–≥–∏ –ø–æ—Å—á–∏—Ç–∞–π—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –∏ —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É;
3. –û–ø—Ä–µ–¥–µ–ª–∏—Ç–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ, –∫–æ—Ç–æ—Ä–æ–µ –≤—ã–ø—É—Å—Ç–∏–ª–æ –Ω–∞–∏–±–æ–ª—å—à–µ–µ —á–∏—Å–ª–æ –∫–Ω–∏–≥ —Ç–æ–ª—â–µ 50 —Å—Ç—Ä–∞–Ω–∏—Ü ‚Äî —Ç–∞–∫ –≤—ã –∏—Å–∫–ª—é—á–∏—Ç–µ –∏–∑ –∞–Ω–∞–ª–∏–∑–∞ –±—Ä–æ—à—é—Ä—ã;
4. –û–ø—Ä–µ–¥–µ–ª–∏—Ç–µ –∞–≤—Ç–æ—Ä–∞ —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ ‚Äî —É—á–∏—Ç—ã–≤–∞–π—Ç–µ —Ç–æ–ª—å–∫–æ –∫–Ω–∏–≥–∏ —Å 50 –∏ –±–æ–ª–µ–µ –æ—Ü–µ–Ω–∫–∞–º–∏;
5. –ü–æ—Å—á–∏—Ç–∞–π—Ç–µ —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 50 –æ—Ü–µ–Ω–æ–∫.

## –ü–æ–¥–∫–ª—é—á–µ–Ω–∏–µ –∫ –±–∞–∑–µ

### –ò–º–ø–æ—Ä—Ç –±–∏–±–ª–∏–æ—Ç–µ–∫

In [1]:
import pandas as pd
from sqlalchemy import create_engine

### –°–æ–∑–¥–∞–Ω–∏–µ –ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è

In [2]:
# —É—Å—Ç–∞–Ω–∞–≤–ª–∏–≤–∞–µ–º –ø–∞—Ä–∞–º–µ—Ç—Ä—ã
db_config = {'user': 'praktikum_student', # –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è
 'pwd': 'Sdf4$2;d-d30pp', # –ø–∞—Ä–æ–ª—å
 'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
 'port': 6432, # –ø–æ—Ä—Ç –ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è
 'db': 'data-analyst-final-project-db'} # –Ω–∞–∑–≤–∞–Ω–∏–µ –±–∞–∑—ã –¥–∞–Ω–Ω—ã—Ö
connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
 db_config['pwd'],
 db_config['host'],
 db_config['port'],
 db_config['db'])

# —Å–æ—Ö—Ä–∞–Ω—è–µ–º –∫–æ–Ω–Ω–µ–∫—Ç–æ—Ä
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

## –ò—Å—Å–ª–µ–¥–æ–≤–∞–Ω–∏–µ —Ç–∞–±–ª–∏—Ü

**–û–ø—Ä–µ–¥–µ–ª–∏–º —Ñ—É–Ω–∫—Ü–∏—é –¥–ª—è –∑–∞–ø—Ä–æ—Å–æ–≤ –∏–∑ –ë–î:**

In [3]:
def select(query): 
    return pd.io.sql.read_sql(query, con=engine)

### –¢–∞–±–ª–∏—Ü–∞ books

**–¢–∞–±–ª–∏—Ü–∞ `books`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –∫–Ω–∏–≥–∞—Ö:

- `book_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;
- `author_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∞–≤—Ç–æ—Ä–∞;
- `title` ‚Äî –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–Ω–∏–≥–∏;
- `num_pages` ‚Äî –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —Å—Ç—Ä–∞–Ω–∏—Ü;
- `publication_date` ‚Äî –¥–∞—Ç–∞ –ø—É–±–ª–∏–∫–∞—Ü–∏–∏ –∫–Ω–∏–≥–∏;
- `publisher_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∏–∑–¥–∞—Ç–µ–ª—è.

In [4]:
books = '''
SELECT *
FROM books
'''
select(books + 'LIMIT 5')

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [5]:
sql = '''
SELECT count(t.book_id) AS books_count,
       count(DISTINCT author_id) AS authors_count,
       count(DISTINCT publisher_id) AS publishers_count
FROM books t
'''
select(sql)

   books_count  authors_count  publishers_count
0         1000            636               340

**–†–∞–∑–º–µ—Ä —Ç–∞–±–ª–∏—Ü—ã:** 6 —Å—Ç–æ–ª–±—Ü–æ–≤ –∏ 1000 —Å—Ç—Ä–æ–∫

–û—Ç–º–µ—Ç–∏–º, —á—Ç–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∞–≤—Ç–æ—Ä–æ–≤ –≤ —Ç–∞–±–ª–∏—Ü–µ 636, –∞ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∏–∑–¥–∞–Ω–∏–π - 340

### –¢–∞–±–ª–∏—Ü–∞ authors

**–¢–∞–±–ª–∏—Ü–∞ `authors`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ–± –∞–≤—Ç–æ—Ä–∞—Ö:

- `author_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∞–≤—Ç–æ—Ä–∞;
- `author` ‚Äî –∏–º—è –∞–≤—Ç–æ—Ä–∞.

In [6]:
authors = '''
SELECT *
FROM authors
'''
select(authors + 'LIMIT 5')

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [7]:
sql = '''
SELECT COUNT(t.author_id) AS authors_count
FROM authors t
'''
select(sql)

   authors_count
0            636

**–†–∞–∑–º–µ—Ä —Ç–∞–±–ª–∏—Ü—ã:** 2 —Å—Ç–æ–ª–±—Ü–∞ –∏ 636 —Å—Ç—Ä–æ–∫

–¢–∞–∫ –∫–∞–∫ –∞–≤—Ç–æ—Ä–æ–≤ –º–µ–Ω—å—à–µ, —á–µ–º –∫–Ω–∏–≥, –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –∑–∞–∫–æ–Ω–æ–º–µ—Ä–Ω—ã–π –≤—ã–≤–æ–¥ –æ —Ç–æ–º, —á—Ç–æ –≤ —Ç–∞–±–ª–∏—Ü–µ –µ—Å—Ç—å –∞–≤—Ç–æ—Ä—ã, –∫–æ—Ç–æ—Ä—ã–µ –Ω–∞–ø–∏—Å–∞–ª–∏ –±–æ–ª—å—à–µ –æ–¥–Ω–æ–π –∫–Ω–∏–≥–∏. –ü—Ä–∏ —ç—Ç–æ–º —á–∏—Å–ª–æ –∞–≤—Ç–æ—Ä–æ–≤ —Ç–∞–±–ª–∏—Ü `authors` –∏ `books` —Å–æ–≤–ø–∞–¥–∞–µ—Ç

### –¢–∞–±–ª–∏—Ü–∞ publishers

**–¢–∞–±–ª–∏—Ü–∞ `publishers`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ–± –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞—Ö:

- `publisher_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞;
- `publisher` ‚Äî –Ω–∞–∑–≤–∞–Ω–∏–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞;

In [8]:
publishers = '''
SELECT *
FROM publishers
'''
select(publishers + 'LIMIT 5')

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

In [9]:
sql = '''
SELECT count(t.publisher_id) AS publishers_count
FROM publishers t
'''
select(sql)

   publishers_count
0               340

**–†–∞–∑–º–µ—Ä —Ç–∞–±–ª–∏—Ü—ã:** 2 —Å—Ç–æ–ª–±—Ü–∞ –∏ 340 —Å—Ç—Ä–æ–∫

–ß–∏—Å–ª–æ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤ —Ç–∞–±–ª–∏—Ü `publishers` –∏ `books` —Å–æ–≤–ø–∞–¥–∞–µ—Ç

### –¢–∞–±–ª–∏—Ü–∞ ratings

**–¢–∞–±–ª–∏—Ü–∞ `ratings`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏—Ö –æ—Ü–µ–Ω–∫–∞—Ö –∫–Ω–∏–≥:

- `rating_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –æ—Ü–µ–Ω–∫–∏;
- `book_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;
- `username` ‚Äî –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è, –æ—Å—Ç–∞–≤–∏–≤—à–µ–≥–æ –æ—Ü–µ–Ω–∫—É;
- `rating` ‚Äî –æ—Ü–µ–Ω–∫–∞ –∫–Ω–∏–≥–∏.

In [10]:
ratings = '''
SELECT *
FROM ratings
'''
select(ratings + 'LIMIT 5')

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [11]:
sql = '''
SELECT count(t.rating_id) AS ratings_count,
       count(DISTINCT t.book_id) AS books_count
FROM ratings t
'''
select(sql)

   ratings_count  books_count
0           6456         1000

**–†–∞–∑–º–µ—Ä —Ç–∞–±–ª–∏—Ü—ã:** 4 —Å—Ç–æ–ª–±—Ü–∞ –∏ 6456 —Å—Ç—Ä–æ–∫

–û—Ü–µ–Ω–∫–∞ –µ—Å—Ç—å —É –∫–∞–∂–¥–æ–π –∫–Ω–∏–≥–∏

### –¢–∞–±–ª–∏—Ü–∞ reviews

**–¢–∞–±–ª–∏—Ü–∞ `reviews`**

–°–æ–¥–µ—Ä–∂–∏—Ç –¥–∞–Ω–Ω—ã–µ –æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏—Ö –æ–±–∑–æ—Ä–∞—Ö –Ω–∞ –∫–Ω–∏–≥–∏:

- `review_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –æ–±–∑–æ—Ä–∞;
- `book_id` ‚Äî –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä –∫–Ω–∏–≥–∏;
- `username` ‚Äî –∏–º—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è, –Ω–∞–ø–∏—Å–∞–≤—à–µ–≥–æ –æ–±–∑–æ—Ä;
- `text` ‚Äî —Ç–µ–∫—Å—Ç –æ–±–∑–æ—Ä–∞.

In [12]:
reviews = '''
SELECT *
FROM reviews
'''
select(reviews + 'LIMIT 5')

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

In [13]:
sql = '''
SELECT count(t.review_id) AS reviews_count,
       count(DISTINCT t.book_id) AS books_count
FROM reviews t
'''
select(sql)

   reviews_count  books_count
0           2793          994

**–†–∞–∑–º–µ—Ä —Ç–∞–±–ª–∏—Ü—ã:** 4 —Å—Ç–æ–ª–±—Ü–∞ –∏ 2793 —Å—Ç—Ä–æ–∫–∏

–ü—Ä–∏ —ç—Ç–æ–º —Å—Ç–æ–∏—Ç –∑–∞–º–µ—Ç–∏—Ç—å, —á—Ç–æ –Ω–∞ 6 –∫–Ω–∏–≥ –Ω–µ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—å—Å–∫–∏—Ö –æ–±–∑–æ—Ä–æ–≤. –≠—Ç–æ –º–æ–∂–µ—Ç –±—ã—Ç—å –≤–∞–∂–Ω–æ –ø—Ä–∏ –¥–∞–ª—å–Ω–µ–π—à–µ–º –∞–Ω–∞–ª–∏–∑–µ

<div class="alert alert-success">

**–ö–æ–º–º–µ–Ω—Ç–∞—Ä–∏–π —Ä–µ–≤—å—é–µ—Ä–∞**
     
–ó–¥–æ—Ä–æ–≤–æ, —á—Ç–æ –¥–∞–Ω–Ω—ã–µ –±—ã–ª–∏ –∏–∑—É—á–µ–Ω—ã –ø–µ—Ä–µ–¥ –∞–Ω–∞–ª–∏–∑–æ–º üëçüèª

##  –ó–∞–¥–∞–Ω–∏—è

1. –ü–æ—Å—á–∏—Ç–∞–π—Ç–µ, —Å–∫–æ–ª—å–∫–æ –∫–Ω–∏–≥ –≤—ã—à–ª–æ –ø–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞;
2. –î–ª—è –∫–∞–∂–¥–æ–π –∫–Ω–∏–≥–∏ –ø–æ—Å—á–∏—Ç–∞–π—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –∏ —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É;
3. –û–ø—Ä–µ–¥–µ–ª–∏—Ç–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ, –∫–æ—Ç–æ—Ä–æ–µ –≤—ã–ø—É—Å—Ç–∏–ª–æ –Ω–∞–∏–±–æ–ª—å—à–µ–µ —á–∏—Å–ª–æ –∫–Ω–∏–≥ —Ç–æ–ª—â–µ 50 —Å—Ç—Ä–∞–Ω–∏—Ü ‚Äî —Ç–∞–∫ –≤—ã –∏—Å–∫–ª—é—á–∏—Ç–µ –∏–∑ –∞–Ω–∞–ª–∏–∑–∞ –±—Ä–æ—à—é—Ä—ã;
4. –û–ø—Ä–µ–¥–µ–ª–∏—Ç–µ –∞–≤—Ç–æ—Ä–∞ —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ ‚Äî —É—á–∏—Ç—ã–≤–∞–π—Ç–µ —Ç–æ–ª—å–∫–æ –∫–Ω–∏–≥–∏ —Å 50 –∏ –±–æ–ª–µ–µ –æ—Ü–µ–Ω–∫–∞–º–∏;
5. –ü–æ—Å—á–∏—Ç–∞–π—Ç–µ —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 50 –æ—Ü–µ–Ω–æ–∫.

### –ö–Ω–∏–≥–∏ –ø–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞

–ü–æ—Å—á–∏—Ç–∞–π—Ç–µ, —Å–∫–æ–ª—å–∫–æ –∫–Ω–∏–≥ –≤—ã—à–ª–æ –ø–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞

#### –†–µ—à–µ–Ω–∏–µ

In [14]:
task_1 = '''
SELECT COUNT(t.book_id) AS books_count
FROM books t
WHERE publication_date > '2000-01-01'
'''
select(task_1)

   books_count
0          819

#### –í—ã–≤–æ–¥

–ü–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞ –≤—ã—à–ª–æ 819 –∫–Ω–∏–≥ –∏–∑ 1000, –ø—Ä–µ–¥—Å—Ç–∞–≤–ª–µ–Ω–Ω—ã—Ö –≤ —Ç–∞–±–ª–∏—Ü–µ

###  –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –∏ —Å—Ä–µ–¥–Ω—è—è –æ—Ü–µ–Ω–∫–∞

–î–ª—è –∫–∞–∂–¥–æ–π –∫–Ω–∏–≥–∏ –ø–æ—Å—á–∏—Ç–∞–π—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –∏ —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É

**–ö–∞–∫–∏–µ –¥–∞–Ω–Ω—ã–µ –Ω–∞–º –ø–æ–Ω–∞–¥–æ–±—è—Ç—Å—è:**
1. `books.book_id`
2. `books.title`
3. `reviews.review_id`
4. `ratings.rating`

**–°—Ç—Ä—É–∫—Ç—É—Ä–∞ –±—É–¥—É—â–µ–π —Ç–∞–±–ª–∏—Ü—ã:**
1. `books.book_id`
2. `books.title`
3. `reviews.reviews_count`
4. `ratings.rating_avg`

**–ü–æ—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å–Ω–æ—Å—Ç—å –æ–±—ä–µ–¥–∏–Ω–µ–Ω–∏–π —Ç–∞–±–ª–∏—Ü:**
1. `reviews` + `ratings` -> `ratings_reviews`
2. `books` + `ratings_reviews` -> `task_final`

#### –ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞ –∫ —Ä–µ—à–µ–Ω–∏—é

**1. –ù–∞–π–¥–µ–º —á–∏—Å–ª–æ –æ–±–∑–æ—Ä–æ–≤ –Ω–∞ –∫–∞–∂–¥—ã—É—é –∫–Ω–∏–≥—É**

In [15]:
sql = '''
SELECT t1.book_id,
       count(t1.review_id) AS reviews_count
FROM reviews t1
GROUP BY t1.book_id
'''
select(sql + 'LIMIT 5')

   book_id  reviews_count
0      652              2
1      273              2
2       51              5
3      951              2
4      839              4

**2. –ù–∞–π–¥–µ–º —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É –∫–∞–∂–¥–æ–π –∫–Ω–∏–≥–∏**

In [16]:
sql = '''
SELECT t2.book_id,
       round(avg(t2.rating), 2) AS rating_avg
FROM ratings t2
GROUP BY t2.book_id
'''
select(sql + 'LIMIT 5')

   book_id  rating_avg
0      652        4.50
1      273        4.50
2       51        4.25
3      951        4.00
4      839        4.29

**3. –ù–∞–π–¥–µ–º —Å—Ä–µ–¥–Ω–∏—é—é –æ—Ü–µ–Ω–∫—É –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –Ω–∞ –∫–∞–∂–¥—É—é –∫–Ω–∏–≥—É**

In [17]:
sql = '''
WITH new_reviews AS
  (SELECT t1.book_id,
          count(t1.review_id) AS reviews_count
   FROM reviews t1
   GROUP BY t1.book_id),
     new_ratings AS
  (SELECT t2.book_id,
          round(avg(t2.rating), 2) AS rating_avg
   FROM ratings t2
   GROUP BY t2.book_id),
     ratings_reviews AS
  (SELECT t3.book_id,
          t3.rating_avg,
          t4.reviews_count
   FROM (new_ratings t3
         LEFT JOIN new_reviews t4 ON t3.book_id = t4.book_id))
SELECT *
FROM ratings_reviews
'''
select(sql + 'LIMIT 5')

   book_id  rating_avg  reviews_count
0        1        3.67              2
1        2        2.50              1
2        3        4.67              3
3        4        4.50              2
4        5        4.00              4

**4. –ü—Ä–æ–≤–µ—Ä–∏–º, —á—Ç–æ –≤ –∏—Ç–æ–≥–æ–≤–æ–π —Ç–∞–±–ª–∏—Ü–µ —Å–æ–¥–µ—Ä–∂–∞—Ç—Å—è –≤—Å–µ –∫–Ω–∏–≥–∏**

In [18]:
sql = '''
WITH new_reviews AS
  (SELECT t1.book_id,
          count(t1.review_id) AS reviews_count
   FROM reviews t1
   GROUP BY t1.book_id),
     new_ratings AS
  (SELECT t2.book_id,
          round(avg(t2.rating), 2) AS rating_avg
   FROM ratings t2
   GROUP BY t2.book_id),
     ratings_reviews AS
  (SELECT t3.book_id,
          t3.rating_avg,
          t4.reviews_count
   FROM (new_ratings t3
         LEFT JOIN new_reviews t4 ON t3.book_id = t4.book_id))
SELECT count(t.book_id)
FROM ratings_reviews t
'''
select(sql)

   count
0   1000

#### –†–µ—à–µ–Ω–∏–µ

In [19]:
task_2 = '''
WITH new_reviews AS
  (SELECT t1.book_id,
          count(t1.review_id) AS reviews_count
   FROM reviews t1
   GROUP BY t1.book_id),
     new_ratings AS
  (SELECT t2.book_id,
          round(avg(t2.rating), 2) AS rating_avg
   FROM ratings t2
   GROUP BY t2.book_id),
     ratings_reviews AS
  (SELECT t3.book_id,
          t3.rating_avg,
          t4.reviews_count
   FROM (new_ratings t3
         LEFT JOIN new_reviews t4 ON t3.book_id = t4.book_id))
SELECT t5.book_id,
       t5.title,
       t6.reviews_count,
       t6.rating_avg
FROM (books t5
      LEFT JOIN ratings_reviews t6 ON t5.book_id = t6.book_id)
'''
select(task_2 + 'where t6.reviews_count is not null order by t6.reviews_count desc limit 10')

,book_id,title,reviews_count,rating_avg
0,948,Twilight (Twilight #1),7,3.66
1,696,The Da Vinci Code (Robert Langdon #2),6,3.83
2,207,Eat Pray Love,6,3.40
3,627,The Alchemist,6,3.79
4,673,The Catcher in the Rye,6,3.83
5,695,The Curious Incident of the Dog in the Night-Time,6,4.08
6,302,Harry Potter and the Prisoner of Azkaban (Harr...,6,4.41
7,299,Harry Potter and the Chamber of Secrets (Harry...,6,4.29
8,497,Outlander (Outlander #1),6,4.13
9,656,The Book Thief,6,4.26

1. –ú–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–µ —á–∏—Å–ª–æ –æ–±–∑–æ—Ä–æ–≤ –ø–æ–ª—É—á–∏–ª–∞ –∫–Ω–∏–≥–∞ —Å id 948 –∏ –Ω–∞–∑–≤–∞–Ω–∏–µ–º `Twilight (Twilight #1)` - —Ü–µ–ª—ã—Ö 7. 6 –æ–±–∑–æ—Ä–æ–≤ –ø–æ–ª—É—á–∏–ª–æ —É–∂–µ –∑–Ω–∞—á–∏—Ç–µ–ª—å–Ω–æ –±–û–ª—å—à–µ–µ —á–∏—Å–ª–æ –∫–Ω–∏–≥
2. –û–¥–Ω–∞–∫–æ –∫–Ω–∏–≥–∏ —Å –±–æ–ª—å—à–∏–º —á–∏—Å–ª–æ–º –æ—Ü–µ–Ω–æ–∫ –¥–∞–ª–µ–∫–æ –Ω–µ –≤—Å–µ–≥–¥–∞ –∏–º–µ—é—Ç –≤—ã—Å–æ–∫–∏–µ –æ—Ü–µ–Ω–∫–∏. –¢–∞–∫, –ø–µ—Ä–≤—ã–µ 5 –ø–æ–∑–∏—Ü–∏–π –ø–æ–ª—É—á–∏–ª–∏ —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É –º–µ–Ω—à—å–µ 4

#### –ü—Ä–≤–µ—Ä–∫–∞

In [20]:
sql = '''
WITH new_reviews AS
  (SELECT t1.book_id,
          count(t1.review_id) AS reviews_count
   FROM reviews t1
   GROUP BY t1.book_id),
     new_ratings AS
  (SELECT t2.book_id,
          round(avg(t2.rating), 2) AS rating_avg
   FROM ratings t2
   GROUP BY t2.book_id),
     ratings_reviews AS
  (SELECT t3.book_id,
          t3.rating_avg,
          t4.reviews_count
   FROM (new_ratings t3
         LEFT JOIN new_reviews t4 ON t3.book_id = t4.book_id)),
     final_tab AS
  (SELECT t5.book_id,
          t5.title,
          t6.reviews_count,
          t6.rating_avg
   FROM (books t5
         LEFT JOIN ratings_reviews t6 ON t5.book_id = t6.book_id))
SELECT count(t.book_id)
FROM final_tab t
'''
select(sql)

   count
0   1000

–í—Å–µ –∫–Ω–∏–≥–∏ –ø–æ–ø–∞–ª–∏ –≤ –∏—Ç–æ–≥–æ–≤—É—é —Ç–∞–±–ª–∏—Ü—É

In [21]:
select(sql + 'where t.reviews_count is null')

   count
0      6

–ü—Ä–∏ —ç—Ç–æ–º –∫–∞–∫ –∏ –ø—Ä–µ–¥–ø–æ–ª–∞–≥–∞–ª–æ—Å—å, 6 –∫–Ω–∏–≥ –æ—Å—Ç–∞–ª–∏—Å—å –±–µ–∑ –æ–±–∑–æ—Ä–æ–≤

#### –í—ã–≤–æ–¥

1. –ú–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–µ —á–∏—Å–ª–æ –æ–±–∑–æ—Ä–æ–≤ –ø–æ–ª—É—á–∏–ª–∞ –∫–Ω–∏–≥–∞ —Å id 948 –∏ –Ω–∞–∑–≤–∞–Ω–∏–µ–º `Twilight (Twilight #1)` - —Ü–µ–ª—ã—Ö 7. 6 –æ–±–∑–æ—Ä–æ–≤ –ø–æ–ª—É—á–∏–ª–æ —É–∂–µ –∑–Ω–∞—á–∏—Ç–µ–ª—å–Ω–æ –±–û–ª—å—à–µ–µ —á–∏—Å–ª–æ –∫–Ω–∏–≥
2. –û–¥–Ω–∞–∫–æ –∫–Ω–∏–≥–∏ —Å –±–æ–ª—å—à–∏–º —á–∏—Å–ª–æ–º –æ—Ü–µ–Ω–æ–∫ –¥–∞–ª–µ–∫–æ –Ω–µ –≤—Å–µ–≥–¥–∞ –∏–º–µ—é—Ç –≤—ã—Å–æ–∫–∏–µ –æ—Ü–µ–Ω–∫–∏. –¢–∞–∫, –ø–µ—Ä–≤—ã–µ 5 –ø–æ–∑–∏—Ü–∏–π –ø–æ–ª—É—á–∏–ª–∏ —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É –º–µ–Ω—à—å–µ 4

### –ò–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ —Å –Ω–∞–∏–±–æ–ª—å—à–∏–º —á–∏—Å–ª–æ–º –∫–Ω–∏–≥

–û–ø—Ä–µ–¥–µ–ª–∏—Ç–µ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–æ, –∫–æ—Ç–æ—Ä–æ–µ –≤—ã–ø—É—Å—Ç–∏–ª–æ –Ω–∞–∏–±–æ–ª—å—à–µ–µ —á–∏—Å–ª–æ –∫–Ω–∏–≥ —Ç–æ–ª—â–µ 50 —Å—Ç—Ä–∞–Ω–∏—Ü ‚Äî —Ç–∞–∫ –≤—ã –∏—Å–∫–ª—é—á–∏—Ç–µ –∏–∑ –∞–Ω–∞–ª–∏–∑–∞ –±—Ä–æ—à—é—Ä—ã

**–ö–∞–∫–∏–µ –¥–∞–Ω–Ω—ã–µ –Ω–∞–º –ø–æ–Ω–∞–¥–æ–±—è—Ç—Å—è:**
1. `publishers.publisher_id`
2. `publishers.publisher`
3. `books.num_pages`
4. `books.publisher_id`
5. `books.book_id`

**–°—Ç—Ä—É–∫—Ç—É—Ä–∞ –±—É–¥—É—â–µ–π —Ç–∞–±–ª–∏—Ü—ã:**
1. `publishers.publisher_id`
2. `publishers.publisher`
3. `books.books_count`

**–ü–æ—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å–Ω–æ—Å—Ç—å –æ–±—ä–µ–¥–∏–Ω–µ–Ω–∏–π —Ç–∞–±–ª–∏—Ü:**
1. `books` - `publishers` -> `books_by_publisher`

#### –ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞ –∫ —Ä–µ—à–µ–Ω–∏—é

**1. –ù–∞–π–¥–µ–º —á–∏—Å–ª–æ –∫–Ω–∏–≥, –æ–ø—É–±–ª–∏–∫–æ–≤–∞–Ω–Ω—ã—Ö –≤ –∫–∞–∂–¥–æ–º –∏–∑–¥–∞–Ω–∏–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –±–æ–ª—å—à–µ 50 —Å—Ç—Ä–∞–Ω–∏—Ü**

In [22]:
sql = '''
SELECT t1.publisher_id,
       count(t1.book_id) AS books_count
FROM books t1
WHERE t1.num_pages > 50
GROUP BY t1.publisher_id
'''
select(sql + 'LIMIT 5')

   publisher_id  books_count
0            87            1
1           184            1
2           116           25
3           273            1
4            51            2

#### –†–µ—à–µ–Ω–∏–µ

In [25]:
task_3 = '''
WITH books_by_publisher AS
  (SELECT t1.publisher_id,
          count(t1.book_id) AS books_count
   FROM books t1
   WHERE t1.num_pages > 50
   GROUP BY t1.publisher_id)
SELECT t2.publisher_id,
       t2.publisher,
       t3.books_count
FROM (publishers t2
      LEFT JOIN books_by_publisher t3 ON t2.publisher_id = t3.publisher_id)
'''

output_cond = '''
WHERE t3.books_count IS NOT NULL
ORDER BY t3.books_count DESC
LIMIT 5
'''
select(task_3 + output_cond)

   publisher_id                 publisher  books_count
0           212             Penguin Books           42
1           309                   Vintage           31
2           116  Grand Central Publishing           25
3           217          Penguin Classics           24
4            35                    Bantam           19

1. –ù–∞–∏–±–æ–ª—å—à–µ–µ —á–∏—Å–ª–æ –æ–ø—É–±–ª–∏–∫–æ–≤–∞–Ω–Ω—ã—Ö –∫–Ω–∏–≥ –Ω–∞–±–ª—é–¥–∞–µ—Ç—Å—è —É –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞ `Penguin Books	`
2. –û—Ç–º–µ—Ç–∏–º, —á—Ç–æ –Ω–µ–∫–æ—Ç–æ—Ä—ã–µ –∏–∑–¥–∞–Ω–∏—è –æ—Å—Ç–∞–ª–∏—Å—å "–±–µ–∑ –∫–Ω–∏–≥", —Ç.–∫. –≤—Å–µ –∫–Ω–∏–≥–∏ –≤ –Ω–∏—Ö

#### –ü—Ä–æ–≤–µ—Ä–∫–∞ –∏–∑–¥–∞–Ω–∏–π "–±–µ–∑ –∫–Ω–∏–≥"

In [26]:
select(task_3 + 'where t3.books_count is null')

   publisher_id                         publisher books_count
0           270  Simon & Schuster Childrens Books        None
1            25  Atheneum Books for Young Readers        None
2           288                        Tanglewood        None
3           112                      Golden Books        None
4           113                     Golden/Disney        None
5            55                  Brilliance Audio        None

In [27]:
sql='''
SELECT max(t.num_pages)
FROM books t
WHERE t.publisher_id = 270
'''
select(sql)

   max
0   14

–ö–∞–∫ –≤–∏–¥–Ω–æ –∏–∑ —Ç–µ—Å—Ç–æ–≤–æ–π –ø—Ä–æ–≤–µ—Ä–∫–∏, —Å–∞–º–∞—è "—Ç–æ–ª—Å—Ç–∞—è" –∫–Ω–∏–≥–∞ —É –∏–∑–¥–∞–Ω–∏—è —Å id 270 - –≤—Å–µ–≥–æ 14 —Å—Ç—Ä–∞–Ω–∏—Ü. –ó–Ω–∞—á–∏—Ç –æ—Ç–±–æ—Ä –¥–∞–Ω–Ω—ã—Ö –ø—Ä–æ–∏–∑–æ—à–µ–ª –∫–æ—Ä—Ä–µ–∫—Ç–Ω–æ

#### –í—ã–≤–æ–¥

1. –ù–∞–∏–±–æ–ª—å—à–µ–µ —á–∏—Å–ª–æ –æ–ø—É–±–ª–∏–∫–æ–≤–∞–Ω–Ω—ã—Ö –∫–Ω–∏–≥ –Ω–∞–±–ª—é–¥–∞–µ—Ç—Å—è —É –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞ `Penguin Books	`
2. –û—Ç–º–µ—Ç–∏–º, —á—Ç–æ –Ω–µ–∫–æ—Ç–æ—Ä—ã–µ –∏–∑–¥–∞–Ω–∏—è –æ—Å—Ç–∞–ª–∏—Å—å "–±–µ–∑ –∫–Ω–∏–≥", —Ç.–∫. –≤—Å–µ –∫–Ω–∏–≥–∏ –≤ –Ω–∏—Ö

### –ê–≤—Ç–æ—Ä —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π

–û–ø—Ä–µ–¥–µ–ª–∏—Ç–µ –∞–≤—Ç–æ—Ä–∞ —Å —Å–∞–º–æ–π –≤—ã—Å–æ–∫–æ–π —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π –∫–Ω–∏–≥ ‚Äî —É—á–∏—Ç—ã–≤–∞–π—Ç–µ —Ç–æ–ª—å–∫–æ –∫–Ω–∏–≥–∏ —Å 50 –∏ –±–æ–ª–µ–µ –æ—Ü–µ–Ω–∫–∞–º–∏

**–ö–∞–∫–∏–µ –¥–∞–Ω–Ω—ã–µ –Ω–∞–º –ø–æ–Ω–∞–¥–æ–±—è—Ç—Å—è:**
1. `authors.author_id`
2. `authors.author`
3. `ratings.rating`
4. `ratings.book_id`
5. `ratings.rating_id`
5. `books.book_id`
6. `books.author_id`

**–°—Ç—Ä—É–∫—Ç—É—Ä–∞ –±—É–¥—É—â–µ–π —Ç–∞–±–ª–∏—Ü—ã:**
1. `authors.author_id`
2. `authors.author`
3. `books_rating.avg_author_rating`

**–ü–æ—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å–Ω–æ—Å—Ç—å –æ–±—ä–µ–¥–∏–Ω–µ–Ω–∏–π —Ç–∞–±–ª–∏—Ü:**
1. `books` (t1) - `ratings` (t2) -> `books_rating` (t3)
2. `authors` - `books_rating`

#### –ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞ –∫ —Ä–µ—à–µ–Ω–∏—é

**1. –ù–∞–π–¥–µ–º —á–∏—Å–ª–æ –æ—Ü–µ–Ω–æ–∫ –Ω–∞ –∫–∞–∂–¥—É—é –∫–Ω–∏–≥—É**

In [28]:
sql = '''
SELECT t.book_id,
       count(t.rating_id) AS rating_count
FROM ratings t
GROUP BY t.book_id
HAVING count(t.rating_id) >= 50
'''
select(sql + 'limit 5')

   book_id  rating_count
0       75            84
1      750            88
2      545            66
3      948           160
4      488            61

**2. –ü–æ—Å–º–æ—Ç—Ä–∏–º, —Å–∫–æ–ª—å–∫–æ –≤—Å–µ–≥–æ –∫–Ω–∏–≥ –∏–º–µ—é—Ç –±–æ–ª–µ–µ 50 –æ—Ü–µ–Ω–æ–∫**

In [29]:
sql = '''
WITH books_50 AS
  (SELECT t.book_id,
          count(t.rating_id) AS rating_count
   FROM ratings t
   GROUP BY t.book_id
   HAVING count(t.rating_id) >= 50)
SELECT count(t.book_id)
FROM books_50 t
'''
select(sql)

   count
0     19

**3. –í—ã–≤–µ–¥–µ–º —Ç–∞–±–ª–∏—Ü—É —Å–æ –≤—Å–µ–º–∏ –æ—Ü–µ–Ω–∫–∞–º–∏ –ø–æ–ø–∞–≤—à–∏—Ö –≤ –≤—ã–±–æ—Ä–∫—É –∫–Ω–∏–≥**

In [30]:
sql = '''
WITH books_50 AS
  (SELECT t.book_id,
          count(t.rating_id) AS rating_count
   FROM ratings t
   GROUP BY t.book_id
   HAVING count(t.rating_id) >= 50)
SELECT t2.book_id,
       t2.rating
FROM (books_50 t1
      LEFT JOIN ratings t2 ON t1.book_id = t2.book_id)
'''
select(sql + 'LIMIT 10')

   book_id  rating
0       75       5
1       75       4
2       75       4
3       75       4
4       75       4
5       75       4
6       75       5
7       75       2
8       75       3
9       75       3

**4. –ù–∞–π–¥–µ–º —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É –≤—Å–µ—Ö –∫–Ω–∏–≥, —Å–≥—Ä—É–ø–ø–∏—Ä–æ–≤–∞–Ω–Ω—ã—Ö –ø–æ –∞–≤—Ç–æ—Ä—É**

In [31]:
sql = '''
WITH books_50 AS
  (SELECT t.book_id,
          count(t.rating_id) AS rating_count
   FROM ratings t
   GROUP BY t.book_id
   HAVING count(t.rating_id) >= 50),
     books_50_rating AS
  (SELECT t2.book_id,
          t2.rating
   FROM (books_50 t1
         INNER JOIN ratings t2 ON t1.book_id = t2.book_id))
SELECT t3.author_id,
       count(t4.rating) AS author_rating_count,
       avg(t4.rating) AS author_avg_rating
FROM (books t3
      INNER JOIN books_50_rating t4 ON t3.book_id = t4.book_id)
GROUP BY t3.author_id
'''
select(sql)

    author_id  author_rating_count  author_avg_rating
0         554                  160           3.662500
1         630                   66           3.787879
2         498                   62           4.080645
3         469                   57           3.789474
4         236                  310           4.287097
5         311                   61           3.622951
6         240                  162           4.246914
7         402                   53           4.264151
8         195                   74           3.729730
9         372                   56           3.750000
10        621                   71           3.901408
11        106                  143           3.741259
12        235                   86           3.825581
13        376                   52           4.192308

#### –†–µ—à–µ–Ω–∏–µ

In [32]:
task_4 = '''
WITH books_50 AS
  (SELECT t.book_id,
          count(t.rating_id) AS rating_count
   FROM ratings t
   GROUP BY t.book_id
   HAVING count(t.rating_id) >= 50),
     books_50_rating AS
  (SELECT t2.book_id,
          t2.rating
   FROM (books_50 t1
         INNER JOIN ratings t2 ON t1.book_id = t2.book_id)),
     top_authors AS
  (SELECT t3.author_id,
          avg(t4.rating) AS author_avg_rating
   FROM (books t3
         INNER JOIN books_50_rating t4 ON t3.book_id = t4.book_id)
   GROUP BY t3.author_id)
SELECT t5.author_id,
       t5.author,
       t6.author_avg_rating
FROM (authors t5
      INNER JOIN top_authors t6 ON t5.author_id = t6.author_id)
ORDER BY t6.author_avg_rating DESC
'''
select(task_4 + 'limit 5')

   author_id                             author  author_avg_rating
0        236         J.K. Rowling/Mary GrandPr√©           4.287097
1        402  Markus Zusak/Cao Xu√¢n Vi·ªát Kh∆∞∆°ng           4.264151
2        240                     J.R.R. Tolkien           4.246914
3        376                  Louisa May Alcott           4.192308
4        498                       Rick Riordan           4.080645

#### –í—ã–≤–æ–¥—ã

1. –í—Å–µ–≥–æ 19 –∫–Ω–∏–≥ –∏–º–µ—é—Ç –±–æ–ª–µ–µ 50 –æ—Ü–µ–Ω–æ–∫
2. –ù–∞–∏–±–æ–ª—å—à—É—é —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É –ø–æ –≤—Å–µ–º –∫–Ω–∏–≥–∞–º –ø–æ–ª—É—á–∏–ª–∏ –∫–Ω–∏–≥–∏ J.K. Rowling –∏ Mary GrandPr√©

### –û–±–∑–æ—Ä—ã –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π

–ü–æ—Å—á–∏—Ç–∞–π—Ç–µ —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ–±–∑–æ—Ä–æ–≤ –æ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 50 –æ—Ü–µ–Ω–æ–∫.

**–ö–∞–∫–∏–µ –¥–∞–Ω–Ω—ã–µ –Ω–∞–º –ø–æ–Ω–∞–¥–æ–±—è—Ç—Å—è:**
1. `ratings.rating_id`
2. `ratings.username`
3. `reviews.username`
4. `reviews.review_id`

**–°—Ç—Ä—É–∫—Ç—É—Ä–∞ –±—É–¥—É—â–µ–π —Ç–∞–±–ª–∏—Ü—ã:**
1. `ratings.username`
2. `ratings.rating_count`
3. `reviews.reviews_count`

**–ü–æ—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å–Ω–æ—Å—Ç—å –æ–±—ä–µ–¥–∏–Ω–µ–Ω–∏–π —Ç–∞–±–ª–∏—Ü:**
1. `ratings` (t1) - `reviews` (t2) -> `rating_review` (t3)

#### –ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞ –∫ —Ä–µ—à–µ–Ω–∏—é

**1. –ù–∞–π–¥–µ–º –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π —Å —á–∏—Å–ª–æ–º –æ—Ü–µ–Ω–æ–∫ –±–æ–ª—å—à–µ 50**

In [33]:
sql='''
SELECT t.username,
       count(t.rating_id) AS rating_count
FROM ratings t
GROUP BY t.username
HAVING count(t.rating_id) > 50
'''
select(sql)

         username  rating_count
0     sfitzgerald            55
1  jennifermiller            53
2          xdavis            51
3          paul88            56
4      martinadam            56
5       richard89            55

–ö–∞–∫ –≤–∏–¥–Ω–æ, —Ç–∞–∫–∏—Ö –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π –≤—Å–µ–≥–æ 6

**2. –ù–∞–π–¥–µ–º —á–∏—Å–ª–æ –æ–±–∑–æ—Ä–æ–≤ –∫–∞–∂–¥–æ–≥–æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è**

In [34]:
sql = '''
SELECT t.username,
       count(t.review_id) AS review_count
FROM reviews t
GROUP BY t.username 
'''
select(sql + 'limit 5')

        username  review_count
0      zjohnston            14
1        jnelson            21
2   lewisdesiree            19
3  patrickhudson            15
4          ulowe            16

#### –†–µ—à–µ–Ω–∏–µ

In [35]:
task_5='''
WITH new_rating AS
  (SELECT t.username,
          count(t.rating_id) AS rating_count
   FROM ratings t
   GROUP BY t.username
   HAVING COUNT(t.rating_id) > 50),
     FINAL AS
  (SELECT t2.username,
          t1.rating_count,
          count(t2.review_id) AS review_count
   FROM (new_rating t1
         INNER JOIN reviews t2 ON t1.username = t2.username)
   GROUP BY t2.username,
            t1.rating_count)
SELECT ROUND(AVG(t.review_count), 2) AS avg_review_count
FROM FINAL t
'''
select(task_5)

   avg_review_count
0             24.33

–í —Å—Ä–µ–¥–Ω–µ–º –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–∏, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 50 –æ—Ü–µ–Ω–æ–∫, –Ω–∞–ø–∏—Å–∞–ª–∏ –ø–æ 24,3 –æ–±–∑–æ—Ä–∞

#### –ü—Ä–æ–≤–µ—Ä–∫–∞

In [36]:
sql ='''
WITH new_rating AS
  (SELECT t.username,
          count(t.rating_id) AS rating_count
   FROM ratings t
   GROUP BY t.username
   HAVING COUNT(t.rating_id) > 50),
     final_tab AS
  (SELECT t2.username,
          t1.rating_count,
          count(t2.review_id) AS review_count
   FROM (new_rating t1
         INNER JOIN reviews t2 ON t1.username = t2.username)
   GROUP BY t2.username,
            t1.rating_count)
SELECT count(t.username)
FROM final_tab t
'''
select(sql)

   count
0      6

–í –∏—Ç–æ–≥–æ–π —Ç–∞–±–ª–∏—Ü–µ, –∫–∞–∫ –∏ –æ–∂–∏–¥–∞–ª–æ—Å—å, –æ—Å—Ç–∞–ª–æ—Å—å –≤—Å–µ–≥–æ 6 –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π

#### –í—ã–≤–æ–¥—ã

1. –í —Å—Ä–µ–¥–Ω–µ–º –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–∏, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 50 –æ—Ü–µ–Ω–æ–∫, –Ω–∞–ø–∏—Å–∞–ª–∏ –ø–æ 24,3 –æ–±–∑–æ—Ä–∞
2. –û–¥–Ω–∞–∫–æ —Ç–∞–∫–∏—Ö –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π –≤ —Ç–∞–±–ª–∏—Ü–µ –≤—Å–µ–≥–æ 6

## –í—ã–≤–æ–¥—ã –ø–æ –∑–∞–¥–∞–Ω–∏—è–º –∏ –ø—Ä–µ–¥–ª–æ–∂–µ–Ω–∏—è

### –í—ã–≤–æ–¥—ã

**–ó–∞–¥–∞–Ω–∏–µ 1**

1. –ü–æ—Å–ª–µ 1 —è–Ω–≤–∞—Ä—è 2000 –≥–æ–¥–∞ –≤—ã—à–ª–æ 819 –∫–Ω–∏–≥ –∏–∑ 1000, –ø—Ä–µ–¥—Å—Ç–∞–≤–ª–µ–Ω–Ω—ã—Ö –≤ —Ç–∞–±–ª–∏—Ü–µ

**–ó–∞–¥–∞–Ω–∏–µ 2**

1. –ú–∞–∫—Å–∏–º–∞–ª—å–Ω–æ–µ —á–∏—Å–ª–æ –æ–±–∑–æ—Ä–æ–≤ –ø–æ–ª—É—á–∏–ª–∞ –∫–Ω–∏–≥–∞ —Å id 948 –∏ –Ω–∞–∑–≤–∞–Ω–∏–µ–º `Twilight (Twilight #1)` - —Ü–µ–ª—ã—Ö 7. 6 –æ–±–∑–æ—Ä–æ–≤ –ø–æ–ª—É—á–∏–ª–æ —É–∂–µ –∑–Ω–∞—á–∏—Ç–µ–ª—å–Ω–æ –±–û–ª—å—à–µ–µ —á–∏—Å–ª–æ –∫–Ω–∏–≥
2. –û–¥–Ω–∞–∫–æ –∫–Ω–∏–≥–∏ —Å –±–æ–ª—å—à–∏–º —á–∏—Å–ª–æ–º –æ—Ü–µ–Ω–æ–∫ –¥–∞–ª–µ–∫–æ –Ω–µ –≤—Å–µ–≥–¥–∞ –∏–º–µ—é—Ç –≤—ã—Å–æ–∫–∏–µ –æ—Ü–µ–Ω–∫–∏. –¢–∞–∫, –ø–µ—Ä–≤—ã–µ 5 –ø–æ–∑–∏—Ü–∏–π –ø–æ–ª—É—á–∏–ª–∏ —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É –º–µ–Ω—à—å–µ 4 

**–ó–∞–¥–∞–Ω–∏–µ 3**

1. –ù–∞–∏–±–æ–ª—å—à–µ–µ —á–∏—Å–ª–æ –æ–ø—É–±–ª–∏–∫–æ–≤–∞–Ω–Ω—ã—Ö –∫–Ω–∏–≥ –Ω–∞–±–ª—é–¥–∞–µ—Ç—Å—è —É –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤–∞ `Penguin Books	`
2. –û—Ç–º–µ—Ç–∏–º, —á—Ç–æ –Ω–µ–∫–æ—Ç–æ—Ä—ã–µ –∏–∑–¥–∞–Ω–∏—è –æ—Å—Ç–∞–ª–∏—Å—å "–±–µ–∑ –∫–Ω–∏–≥", —Ç.–∫. –≤—Å–µ –∫–Ω–∏–≥–∏ –≤ –Ω–∏—Ö 

**–ó–∞–¥–∞–Ω–∏–µ 4**

1. –í—Å–µ–≥–æ 19 –∫–Ω–∏–≥ –∏–º–µ—é—Ç –±–æ–ª–µ–µ 50 –æ—Ü–µ–Ω–æ–∫
2. –ù–∞–∏–±–æ–ª—å—à—É—é —Å—Ä–µ–¥–Ω—é—é –æ—Ü–µ–Ω–∫—É –ø–æ –≤—Å–µ–º –∫–Ω–∏–≥–∞–º –ø–æ–ª—É—á–∏–ª–∏ –∫–Ω–∏–≥–∏ J.K. Rowling –∏ Mary GrandPr√©

**–ó–∞–¥–∞–Ω–∏–µ 5**

1. –í —Å—Ä–µ–¥–Ω–µ–º –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–∏, –∫–æ—Ç–æ—Ä—ã–µ –ø–æ—Å—Ç–∞–≤–∏–ª–∏ –±–æ–ª—å—à–µ 50 –æ—Ü–µ–Ω–æ–∫, –Ω–∞–ø–∏—Å–∞–ª–∏ –ø–æ 24,3 –æ–±–∑–æ—Ä–∞
2. –û–¥–Ω–∞–∫–æ —Ç–∞–∫–∏—Ö –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π –≤ —Ç–∞–±–ª–∏—Ü–µ –≤—Å–µ–≥–æ 6

### –ü—Ä–µ–¥–ª–æ–∂–µ–Ω–∏—è

–í —Ü–µ–ª–æ–º, –ø—Ä–µ–¥–ª–æ–∂–µ–Ω–∏—è –º–æ–≥—É—Ç –±—ã—Ç—å —Å–ª–µ–¥—É—é—â–∏–µ: 
1. –ë–æ–ª—å—à–æ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –æ—Ü–µ–Ω–æ–∫ –∏ –æ–±–∑–æ—Ä–æ–≤ –¥–∞—é—Ç –±–æ–ª–µ–µ –æ–±—ä–µ–∫—Ç–∏–≤–Ω—É—é –æ—Ü–µ–Ω–∫—É. –û–¥–Ω–∞–∫–æ —ç—Ç–∞ –æ—Ü–µ–Ω–∫–∞ –¥–∞–ª–µ–∫–æ –Ω–µ –≤—Å–µ–≥–¥–∞ –≤—ã–æ—Å–∫–∞—è. –í —Ä–µ–∫–æ–º–µ–Ω–¥–∞—Ç–µ–ª—å–Ω—É—é —Å–∏—Å—Ç–µ–º—É —Å—Ç–æ–∏—Ç –≤–∫–ª—é—á–∞—Ç—å –∫–Ω–∏–≥–∏ —Å –¥–æ—Å—Ç–∞—Ç–æ—á–Ω–æ –±–æ–ª—å—à–∏–º —á–∏—Å–ª–æ–º –æ–±–∑–æ—Ä–æ–≤ –∏ –æ—Ü–µ–Ω–æ–∫, –Ω–æ –µ—â–µ –∏ —Å–æ —Å—Ä–µ–¥–Ω–µ–π –æ—Ü–µ–Ω–∫–æ–π —á—É—Ç—å –≤—ã—à–µ —Å—Ä–µ–¥–Ω–µ–≥–æ 
2. –†–µ–∫–æ–º–µ–Ω–¥–∞—Ü–∏–∏ –º–æ–∂–Ω–æ –≤—ã—Å—Ç—Ä–∞–∏–≤–∞—Ç—å –Ω–∞ –æ—Å–Ω–æ–≤–µ —Å–æ–≤–ø–∞–¥–µ–Ω–∏—è –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤. –í–æ–∑–º–æ–∂–Ω–æ, –∫–Ω–∏–≥–∏ –∏–∑–¥–∞—Ç–µ–ª—å—Å—Ç–≤ –±—É–¥—É—Ç –∏–º–µ—Ç—å —Å—Ö–æ–∂–∏–µ —á–µ—Ä—Ç—ã –∏ –Ω—Ä–∞–≤–∏—Ç—å—Å—è –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—é 
3. –ï—Å—Ç—å –∞–≤—Ç–æ—Ä—ã —Å –∫–Ω–∏–≥–∞–º–∏-–±–µ—Å—Ç—Å–µ–ª–ª–µ—Ä–∞–º–∏. –£ –Ω–∏—Ö –æ—á–µ–Ω—å –≤—ã—Å–æ–∫–∏–µ —Å—Ä–µ–¥–Ω–∏–µ –æ—Ü–µ–Ω–∫–∏. –í–æ–∑–º–æ–∂–Ω–æ, —Å—Ç–æ–∏—Ç –∞–∫—Ü–µ–Ω—Ç–∏—Ä–æ–≤–∞—Ç—å –≤–Ω–∏–º–∞–Ω–∏–µ –Ω–∞ —ç—Ç–∏—Ö –∞–≤—Ç–æ—Ä–∞—Ö –∏ –∏—Ö –∫–Ω–∏–≥–∞—Ö 
4. –í –±–∞–∑–µ –µ—Å—Ç—å —Å—É–ø–µ—Ä –∞–∫—Ç–∏–≤–Ω—ã–µ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–∏, –∫–æ—Ç–æ—Ä—ã–µ —Å—Ç–∞–≤—è—Ç –æ–≥—Ä–æ–º–Ω–æ–µ —á–∏—Å–ª–æ –æ—Ü–µ–Ω–æ–∫ –∏ –≤–º–µ—Å—Ç–µ —Å —ç—Ç–∏–º –ø–∏—à—É—Ç –æ–≥—Ä–æ–º–Ω–æ–µ —á–∏—Å–ª–æ –æ–±–∑–æ—Ä–æ–≤. –í–æ–∑–º–æ–∂–Ω–æ –Ω–∞ –æ—Å–Ω–æ–≤–µ –æ–±—â–Ω–æ—Å—Ç–∏ –æ–±–æ–∑—Ä–µ–≤–∞–µ–º—ã—Ö –∏–º–∏ –∫–Ω–∏–≥ —Ç–∞–∫–∂–µ –º–æ–∂–Ω–æ –≤—ã—Å—Ç—Ä–∞–∏–≤–∞—Ç—å –Ω–µ–∫–æ—Ç–æ—Ä—ã–µ —Ä–µ–∫–æ–º–µ–Ω–¥–∞—Ü–∏–∏